In [9]:
import pandas as pd

In [10]:
strokeData = pd.read_csv('../Data/stroke-data.csv')
strokeData.head()

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,9046,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,51676,Female,61.0,0,0,Yes,Self-employed,Rural,202.21,NaN,never smoked,1
2,31112,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
3,60182,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
4,1665,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1

Feature Generation

Binning

Creating Bins

In [11]:
bins=[0,12,19,30,60,90]
group = ['child','teenager','young_adult','middle_aged','senior_citizen']
strokeData['age_category'] = pd.cut(strokeData['age'], bins, labels =group)

In [12]:
strokeData[['age','age_category']].head(10)

    age    age_category
0  67.0  senior_citizen
1  61.0  senior_citizen
2  80.0  senior_citizen
3  49.0     middle_aged
4  79.0  senior_citizen
5  81.0  senior_citizen
6  74.0  senior_citizen
7  69.0  senior_citizen
8  59.0     middle_aged
9  78.0  senior_citizen

Binning using Decision tree split

In [13]:
bins=[0,49.5,66.5,77.5,90]
group = ['Bin_1','Bin_2','Bin_3','Bin_4']
strokeData['age_category'] = pd.cut(strokeData['age'], bins, labels =group)

In [14]:
strokeData[['age','age_category']].head(10)

    age age_category
0  67.0        Bin_3
1  61.0        Bin_2
2  80.0        Bin_4
3  49.0        Bin_1
4  79.0        Bin_4
5  81.0        Bin_4
6  74.0        Bin_3
7  69.0        Bin_3
8  59.0        Bin_2
9  78.0        Bin_4

Handling missing values

Using null values create another column

In [16]:
strokeData.isnull().sum()

id                     0
gender                 0
age                    0
hypertension           0
heart_disease          0
ever_married           0
work_type              0
Residence_type         0
avg_glucose_level      0
bmi                  201
smoking_status         0
stroke                 0
age_category           0
dtype: int64

In [17]:
#there are no null values in smoking status. Therefore below codes are not working
#strokeData['smoking_status_NA'] = strokeData['smoking_status'].isnull()*1
#strokeData[['smoking_status_NA','smoking_status']].head()

   smoking_status_NA   smoking_status
0                  0  formerly smoked
1                  0     never smoked
2                  0     never smoked
3                  0           smokes
4                  0     never smoked